SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F10X motor 2.h
/**************************   VOLTAGE CONVERSIONS  ****************************/
#define BUS_ADC_CONV_RATIO2       VBUS_PARTITIONING_FACTOR2

#define OVERVOLTAGE_THRESHOLD_d2   (uint16_t)(OV_VOLTAGE_THRESHOLD_V2*65535/\
                                  (MCU_SUPPLY_VOLTAGE/VBUS_PARTITIONING_FACTOR2))
#define UNDERVOLTAGE_THRESHOLD_d2  (uint16_t)((UD_VOLTAGE_THRESHOLD_V2*65535)/\
                                  ((uint16_t)(MCU_SUPPLY_VOLTAGE/\
                                                           BUS_ADC_CONV_RATIO2)))

#define INT_SUPPLY_VOLTAGE2          (uint16_t)(65536/MCU_SUPPLY_VOLTAGE)

#define DELTA_TEMP_THRESHOLD2        (OV_TEMPERATURE_THRESHOLD_C2- T0_C2)
#define DELTA_V_THRESHOLD2           (dV_dT2 * DELTA_TEMP_THRESHOLD2)
#define OV_TEMPERATURE_THRESHOLD_d2  ((V0_V2 + DELTA_V_THRESHOLD2)*INT_SUPPLY_VOLTAGE2)

#define DELTA_TEMP_HYSTERESIS2        (OV_TEMPERATURE_HYSTERESIS_C2)
#define DELTA_V_HYSTERESIS2           (dV_dT2 * DELTA_TEMP_HYSTERESIS2)
#define OV_TEMPERATURE_HYSTERESIS_d2  (DELTA_V_HYSTERESIS2*INT_SUPPLY_VOLTAGE2)
														  														  
/*************************  PWM IDLE STATES AND POLARITY  *********************/														  
#define H_ACTIVE_HIGH    0x0000u //TIM_OCPolarity_High
#define H_ACTIVE_LOW     0x0002u //TIM_OCPolarity_Low
#define L_ACTIVE_HIGH    0x0000u  //TIM_OCNPolarity_High
#define L_ACTIVE_LOW     0x0008u  //TIM_OCNPolarity_Low 

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if (PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

/**********  SPEED FEEDBACK TIMERS SETTING *************/
#if (defined(HALL_SENSORS2) || defined(AUX_HALL_SENSORS2))
  #if (HALL_TIMER_SELECTION2 == HALL_TIM2)
  #define HALL_TIMER2 				TIM2  
  #define HALL_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2  
  #define HALL_IRQ_CHANNEL2  		TIM2_IRQn
  #elif (HALL_TIMER_SELECTION2 == HALL_TIM3)
  #define HALL_TIMER2 				TIM3  
  #define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM3
  #define HALL_IRQ_CHANNEL2  		TIM3_IRQn  
  #elif (HALL_TIMER_SELECTION2 == HALL_TIM4)
  #define HALL_TIMER2 				TIM4  
  #define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM4  
  #define HALL_IRQ_CHANNEL2  		TIM4_IRQn
  #elif (HALL_TIMER_SELECTION2 == HALL_TIM5)
  #define HALL_TIMER2 				TIM5  
  #define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM5
  #define HALL_IRQ_CHANNEL2  		TIM5_IRQn  
  #else
  #error "Hall parameters not defined in Control Stage parametes motor2.h"
  #endif
#else
  /* Dummy value to avoid compiler error */
  #undef HALL_TIMER2
  #undef HALL_TIMER_REMAPPING2
  #undef HALL_RCC_PERIPHERAL2
  #undef HALL_IRQ_CHANNEL2
  #undef H1_GPIO_PORT2
  #undef H2_GPIO_PORT2
  #undef H3_GPIO_PORT2
  #undef H1_GPIO_PIN2
  #undef H2_GPIO_PIN2
  #undef H3_GPIO_PIN2
  #define HALL_TIMER2 				    TIM2
  #define HALL_TIMER_REMAPPING2  NO_REMAP_TIM2
  #define HALL_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2
  #define HALL_IRQ_CHANNEL2  		TIM2_IRQn
  #define H1_GPIO_PORT2          GPIOA
  #define H2_GPIO_PORT2          GPIOA
  #define H3_GPIO_PORT2          GPIOA
  #define H1_GPIO_PIN2           GPIO_Pin_0
  #define H2_GPIO_PIN2           GPIO_Pin_1
  #define H3_GPIO_PIN2           GPIO_Pin_2
#endif

#if (defined(ENCODER2) || defined(AUX_ENCODER2))
  #if (ENC_TIMER_SELECTION2 == ENC_TIM2)
  #define ENC_TIMER2 				TIM2  
  #define ENC_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2  
  #define ENC_IRQ_CHANNEL2  		TIM2_IRQn
  #elif (ENC_TIMER_SELECTION2 == ENC_TIM3)
  #define ENC_TIMER2 				TIM3  
  #define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM3
  #define ENC_IRQ_CHANNEL2  		TIM3_IRQn  
  #elif (ENC_TIMER_SELECTION2 == ENC_TIM4)
  #define ENC_TIMER2 				TIM4  
  #define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM4  
  #define ENC_IRQ_CHANNEL2  		TIM4_IRQn
  #elif (ENC_TIMER_SELECTION2 == ENC_TIM5)
  #define ENC_TIMER2 				TIM5  
  #define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM5
  #define ENC_IRQ_CHANNEL2  		TIM5_IRQn  
  #else
  #error "Encoder parameters not defined in Control Stage parametes motor2.h"
  #endif
#else
  /* Dummy value to avoid compiler error */
  #undef  ENC_TIMER2
  #undef  ENC_TIMER_REMAPPING2
  #undef  ENC_RCC_PERIPHERAL2
  #undef  ENC_IRQ_CHANNEL2
  #undef  ENC_A_GPIO_PORT2
  #undef  ENC_B_GPIO_PORT2
  #undef  ENC_A_GPIO_PIN2
  #undef  ENC_B_GPIO_PIN2

  #define ENC_TIMER2 				    TIM2
  #define ENC_TIMER_REMAPPING2   NO_REMAP_TIM2
  #define ENC_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2
  #define ENC_IRQ_CHANNEL2  		  TIM2_IRQn
  #define ENC_A_GPIO_PORT2       GPIOA
  #define ENC_B_GPIO_PORT2       GPIOA
  #define ENC_A_GPIO_PIN2        GPIO_Pin_0
  #define ENC_B_GPIO_PIN2        GPIO_Pin_1
#endif

/* Resistive Brake */
#if (ON_OVER_VOLTAGE2 != TURN_ON_R_BRAKE)
  /* Dummy value to avoid compiler error */
  #undef R_BRAKE_GPIO_PORT2
  #undef R_BRAKE_GPIO_PIN2
  
  #define R_BRAKE_GPIO_PORT2    GPIOD
  #define R_BRAKE_GPIO_PIN2     GPIO_Pin_13
#endif

/* Hardware over current protection bypass */
#if (HW_OV_CURRENT_PROT_BYPASS2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef OV_CURR_BYPASS_GPIO_PORT2
  #undef OV_CURR_BYPASS_GPIO_PIN2
  
  #define OV_CURR_BYPASS_GPIO_PORT2  GPIOD        
  #define OV_CURR_BYPASS_GPIO_PIN2   GPIO_Pin_13
#endif

