SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F10X motor 2.h
#if (LOG2(FW_KPDIV2)==-1)
  #error "Error: FW_KPDIV2 defined in Drive parameters motor 2.h must be power of two."
#else
  #define FW_KPDIV_LOG2 LOG2(FW_KPDIV2)
#endif

#if (LOG2(FW_KIDIV2)==-1)
  #error "Error: FW_KIDIV2 defined in Drive parameters motor 2.h must be power of two."
#else
  #define FW_KIDIV_LOG2 LOG2(FW_KIDIV2)
#endif

#define PLL_KPDIV2     16384
#define PLL_KIDIV2     65535

#if (LOG2(PLL_KPDIV2)==-1)
  #error "Error: PLL_KPDIV2 defined in Drive parameters motor 2.h must be power of two."
#else
  #define PLL_KPDIV_LOG2 LOG2(PLL_KPDIV2)
#endif

#if (LOG2(PLL_KIDIV2)==-1)
  #error "Error: PLL_KIDIV2 defined in Drive parameters motor 2.h must be power of two."
#else
  #define PLL_KIDIV_LOG2 LOG2(PLL_KIDIV2)
#endif

#if (LOG2(F12)==-1)
  #error "Error: F12 defined in Drive parameters motor 2.h must be power of two."
#else
  #define F1_LOG2 LOG2(F12)
#endif

#if (LOG2(F22)==-1)
  #error "Error: F22 defined in Drive parameters motor 2.h must be power of two."
#else
  #define F2_LOG2 LOG2(F22)
#endif

#if (LOG2(STO_FIFO_DEPTH_DPP2)==-1)
  #error "Error: STO_FIFO_DEPTH_DPP2 in Drive parameters motor 2.h must be power of two."
#else
  #define STO_FIFO_DEPTH_DPP_LOG2 LOG2(STO_FIFO_DEPTH_DPP2)
#endif

#if (LOG2(CORD_FIFO_DEPTH_DPP2)==-1)
  #error "Error: CORD_FIFO_DEPTH_DPP2 in Drive parameters motor 2.h must be power of two."
#else
  #define CORD_FIFO_DEPTH_DPP_LOG2 LOG2(CORD_FIFO_DEPTH_DPP2)
#endif

#if (LOG2(HFI_PID_KPDIV2)==-1)
  #error "Error: HFI_PID_KPDIV2 defined in Drive parameters.h must be power of two."
#else
  #define HFI_PID_KPDIV_LOG2 LOG2(HFI_PID_KPDIV2)
#endif

#if (LOG2(HFI_PID_KIDIV2)==-1)
  #error "Error: HFI_PID_KIDIV2 defined in Drive parameters.h must be power of two."
#else
  #define HFI_PID_KIDIV_LOG2 LOG2(HFI_PID_KIDIV2)
#endif

#if (BUS_VOLTAGE_READING2 == ENABLE)
 #if ((OV_VOLTAGE_PROT_ENABLING2 != ENABLE) || (UV_VOLTAGE_PROT_ENABLING2!= ENABLE))
  #error "Configuration not supported by this version of the library. Under and Over voltage protections (motor 2) must be enabled if bus voltage sensing is enabled."
 #else
  #define BUS_VOLTAGE_MEASUREMENT2
 #endif
#endif

#if ((TEMPERATURE_READING2 == ENABLE) && (OV_TEMPERATURE_PROT_ENABLING2 == ENABLE))
 #define HEAT_SINK_TEMPERATURE_MEASUREMENT2
#endif

#if (VBUS_ADC_SAMPLING_TIME2 == 1)
#define VBUS_SAMPLING_TIME2  ADC_SampleTime_1Cycles5
#elif (VBUS_ADC_SAMPLING_TIME2 == 7)
#define VBUS_SAMPLING_TIME2  ADC_SampleTime_7Cycles5
#elif (VBUS_ADC_SAMPLING_TIME2 == 13)
#define VBUS_SAMPLING_TIME2  ADC_SampleTime_13Cycles5
#elif (VBUS_ADC_SAMPLING_TIME2 == 28)
#define VBUS_SAMPLING_TIME2  ADC_SampleTime_28Cycles5
#else
#define VBUS_SAMPLING_TIME2  ADC_SampleTime_1Cycles5
#endif

#if (TEMP_ADC_SAMPLING_TIME2 == 1)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_1Cycles5
#elif (TEMP_ADC_SAMPLING_TIME2 == 7)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_7Cycles5
#elif (TEMP_ADC_SAMPLING_TIME2 == 13)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_13Cycles5
#elif (TEMP_ADC_SAMPLING_TIME2 == 28)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_28Cycles5
#else
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_1Cycles5
#endif

#define TEMP_SW_FILTER_BW_FACTOR2     250u
#define VQD_SW_FILTER_BW_FACTOR2      128u
#define VBUS_SW_FILTER_BW_FACTOR2     10u

#if (LOG2(VQD_SW_FILTER_BW_FACTOR2)==-1)
  #error "Error: VQD_SW_FILTER_BW_FACTOR2 defined in Drive parameters motor 2.h must be power of two."
#else
  #define VQD_SW_FILTER_BW_FACTOR_LOG2 LOG2(VQD_SW_FILTER_BW_FACTOR2)
#endif

#if (FREQ_RELATION ==  HIGHEST_FREQ) /* First instance has higher frequency */
#define PWM_FREQUENCY_CHECK_RATIO   (PWM_FREQUENCY*10000u/PWM_FREQUENCY2)
#else /* Second instance has higher frequency */
#define PWM_FREQUENCY_CHECK_RATIO   (PWM_FREQUENCY2*10000u/PWM_FREQUENCY)
#endif

#define MAGN_FREQ_RATIO   (FREQ_RATIO*10000u)

#ifdef DUALDRIVE
#if (PWM_FREQUENCY_CHECK_RATIO != MAGN_FREQ_RATIO)
#error "The two motor PWM frequencies should be integer multiple"  
#endif
#endif

#undef HIGHEST_FREQ
#undef LOWEST_FREQ
#define HIGHEST_FREQ    HIGHER_FREQ
#define LOWEST_FREQ     LOWER_FREQ

#if ((defined STATE_OBSERVER_PLL2) || (defined STATE_OBSERVER_CORDIC2))
#define NO_SPEED_SENSORS2
#endif

#if (MTPA_ENABLING2 == ENABLE)
#define IPMSM_MTPA2
#endif

#if (FEED_FORWARD_CURRENT_REG_ENABLING2 == ENABLE)
#define FEED_FORWARD_CURRENT_REGULATION2
#endif

#if (FLUX_WEAKENING_ENABLING2 == ENABLE)
#define FLUX_WEAKENING2
#endif

#if defined AUX_ENCODER
#define VIEW_ENCODER_FEEDBACK
#endif

#if defined AUX_HALL_SENSORS
#define VIEW_HALL_FEEDBACK
#endif

#ifdef SINGLE_SHUNT
#define M2FIRSTR1 FALSE
#else
#define M2FIRSTR1 TRUE
#endif

#if (defined(SINGLE_SHUNT2) || defined(THREE_SHUNT2))
#define PQD_CONVERSION_FACTOR2 (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * RSHUNT2 * AMPLIFICATION_GAIN2 ))
#endif

#if (defined(ICS_SENSORS2))
#define PQD_CONVERSION_FACTOR2 (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * AMPLIFICATION_GAIN2 ))
#endif

/****** Prepares the UI configurations according the MCconfxx settings ********/
/* Motor 2 settings */
#ifdef FLUX_WEAKENING2
  #define FW_ENABLE2 |UI_CFGOPT_FW
#else
  #define FW_ENABLE2
#endif

#ifdef DIFFERENTIAL_TERM_ENABLED2
  #define DIFFTERM_ENABLE2 |UI_CFGOPT_SPEED_KD|UI_CFGOPT_Iq_KD|UI_CFGOPT_Id_KD
#else
  #define DIFFTERM_ENABLE2
#endif

/* Sensors setting */
#ifdef STATE_OBSERVER_PLL2
  #define MAIN_SCFG2 UI_SCODE_STO_PLL
#endif

#ifdef STATE_OBSERVER_CORDIC2
  #define MAIN_SCFG2 UI_SCODE_STO_CR
#endif

#ifdef AUX_STATE_OBSERVER_PLL2
  #define AUX_SCFG2 UI_SCODE_STO_PLL
#endif

#ifdef AUX_STATE_OBSERVER_CORDIC2
  #define AUX_SCFG2 UI_SCODE_STO_CR
#endif

#ifdef ENCODER2
  #define MAIN_SCFG2 UI_SCODE_ENC
#endif

#ifdef VIEW_ENCODER_FEEDBACK2
  #define AUX_SCFG2 UI_SCODE_ENC
#endif

#ifdef HALL_SENSORS2
  #define MAIN_SCFG2 UI_SCODE_HALL
#endif

#ifdef VIEW_HALL_FEEDBACK2
  #define AUX_SCFG2 UI_SCODE_HALL
#endif

#ifndef AUX_SCFG2
#define AUX_SCFG2 0x0
#endif

#if defined(PLLTUNING)
  #define PLLTUNING_ENABLE2 |UI_CFGOPT_PLLTUNING
#else
  #define PLLTUNING_ENABLE2
#endif

/******************************************************************************* 
  * UI configurations settings. It can be manually overwritten if special 
  * configuartion is required. 
*******************************************************************************/
#ifdef DUALDRIVE
  #define UI_CONFIG_M2 ( UI_CFGOPT_NONE DAC_OP_ENABLE FW_ENABLE DIFFTERM_ENABLE2\
    | (MAIN_SCFG2 << MAIN_SCFG_POS) | (AUX_SCFG2 << AUX_SCFG_POS) | UI_CFGOPT_SETIDINSPDMODE PLLTUNING_ENABLE2 )
#endif

#endif /*__PARAMETERS_CONVERSION_F10X_MOTOR2_H*/

/******************* (C) COPYRIGHT 2016 STMicroelectronics *****END OF FILE****/
